src/test/resources/reconciliation/payment_report.json

{
  "count": 2,
  "data": [
    {
      "id": "pay_nezg6bx2k22utmk4xm5s2ughxi",
      "processing_currency": "USD",
      "payout_currency": "GBP",
      "requested_on": "2019-03-08T10:29:51Z",
      "channel_name": "www.example.com",
      "reference": "ORD-5023-4E89",
      "payment_method": "VISA",
      "card_type": "CREDIT",
      "card_category": "Consumer",
      "issuer_country": "US",
      "merchant_country": "SI",
      "mid": "123456",
      "actions": [
        {
          "type": "Authorization",
          "id": "act_nezg6bx2k22utmk4xm5s2ughxi",
          "processed_on": "2019-03-08T10:29:51Z",
          "response_code": "10000",
          "response_description": "Approved",
          "breakdown": [
            {
              "type": "Gateway Fee Tax ARE USD/GBP@0.7640412612",
              "date": "2019-03-08T10:29:51Z",
              "processing_currency_amount": "-0.003",
              "payout_currency_amount": "-0.00229212"
            }
          ]
        }
      ],
      "_links": {
        "payments": {
          "href": "http://api.checkout.com/reporting/statements/190110B107654/payments"
        }
      }
    },
    {
      "id": "pay_nezg6bx2k22utmk4xm5s2ughxi",
      "processing_currency": "USD",
      "payout_currency": "GBP",
      "requested_on": "2019-03-08T10:29:51Z",
      "channel_name": "www.example.com",
      "reference": "ORD-5023-4E89",
      "payment_method": "VISA",
      "card_type": "CREDIT",
      "card_category": "Consumer",
      "issuer_country": "US",
      "merchant_country": "SI",
      "mid": "123456",
      "actions": [
        {
          "type": "Authorization",
          "id": "act_nezg6bx2k22utmk4xm5s2ughxi",
          "processed_on": "2019-03-08T10:29:51Z",
          "response_code": "10000",
          "response_description": "Approved",
          "breakdown": [
            {
              "type": "Gateway Fee Tax ARE USD/GBP@0.7640412612",
              "date": "2019-03-08T10:29:51Z",
              "processing_currency_amount": "-0.003",
              "payout_currency_amount": "-0.00229212"
            }
          ]
        }
      ],
      "_links": {
        "payments": {
          "href": "http://api.checkout.com/reporting/statements/190110B107654/payments"
        }
      }
    }
  ],
  "_links": {
    "next": {
      "href": "http://api.checkout.com/reporting/payments?from=01%2F03%2F2019%2000%3A00%3A00&to=01%2F03%2F2019%2000%3A00%3A00&limit=1&after=11111111"
    },
    "self": {
      "href": "http://api.checkout.com/reporting/payments?from=01%2F03%2F2019%2000%3A00%3A00&to=01%2F03%2F2019%2000%3A00%3A00&limit=1"
    }
  }
}